app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2017-05-20 10:43:20.793339"], ["updated_at", "2017-05-20 10:43:20.801425"], ["image_file_name", "img1.jpg"], ["id", 16]]
---
  	def update
  		@article = Article.find(params[:id])
  		@article.update(article_params)